HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSent_reg.h
/** Alias (User Manual Name) for SENT_CH0_WDT.
* To use register names with standard convension, please use SENT_CH0_WDT.
*/
#define	SENT_WDT0	(SENT_CH0_WDT)

/** \\brief  384, Channel Fractional Divider Register */
#define SENT_CH10_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003384u)

/** Alias (User Manual Name) for SENT_CH10_CFDR.
* To use register names with standard convension, please use SENT_CH10_CFDR.
*/
#define	SENT_CFDR10	(SENT_CH10_CFDR)

/** \\brief  380, Channel Pre Divider Register */
#define SENT_CH10_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003380u)

/** Alias (User Manual Name) for SENT_CH10_CPDR.
* To use register names with standard convension, please use SENT_CH10_CPDR.
*/
#define	SENT_CPDR10	(SENT_CH10_CPDR)

/** \\brief  3B0, Interrupt Node Pointer Register */
#define SENT_CH10_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF00033B0u)

/** Alias (User Manual Name) for SENT_CH10_INP.
* To use register names with standard convension, please use SENT_CH10_INP.
*/
#define	SENT_INP10	(SENT_CH10_INP)

/** \\brief  3A8, Interrupt Clear Register */
#define SENT_CH10_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF00033A8u)

/** Alias (User Manual Name) for SENT_CH10_INTCLR.
* To use register names with standard convension, please use SENT_CH10_INTCLR.
*/
#define	SENT_INTCLR10	(SENT_CH10_INTCLR)

/** \\brief  3AC, Interrupt Enable Register */
#define SENT_CH10_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF00033ACu)

/** Alias (User Manual Name) for SENT_CH10_INTEN.
* To use register names with standard convension, please use SENT_CH10_INTEN.
*/
#define	SENT_INTEN10	(SENT_CH10_INTEN)

/** \\brief  3A4, Interrupt Set Register */
#define SENT_CH10_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF00033A4u)

/** Alias (User Manual Name) for SENT_CH10_INTSET.
* To use register names with standard convension, please use SENT_CH10_INTSET.
*/
#define	SENT_INTSET10	(SENT_CH10_INTSET)

/** \\brief  3A0, Interrupt Status Register */
#define SENT_CH10_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF00033A0u)

/** Alias (User Manual Name) for SENT_CH10_INTSTAT.
* To use register names with standard convension, please use SENT_CH10_INTSTAT.
*/
#define	SENT_INTSTAT10	(SENT_CH10_INTSTAT)

/** \\brief  394, Input and Output Control Register */
#define SENT_CH10_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003394u)

/** Alias (User Manual Name) for SENT_CH10_IOCR.
* To use register names with standard convension, please use SENT_CH10_IOCR.
*/
#define	SENT_IOCR10	(SENT_CH10_IOCR)

/** \\brief  388, Receiver Control Register */
#define SENT_CH10_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003388u)

/** Alias (User Manual Name) for SENT_CH10_RCR.
* To use register names with standard convension, please use SENT_CH10_RCR.
*/
#define	SENT_RCR10	(SENT_CH10_RCR)

/** \\brief  38C, Receive Status Register */
#define SENT_CH10_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000338Cu)

/** Alias (User Manual Name) for SENT_CH10_RSR.
* To use register names with standard convension, please use SENT_CH10_RSR.
*/
#define	SENT_RSR10	(SENT_CH10_RSR)

/** \\brief  398, SPC Control Register */
#define SENT_CH10_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003398u)

/** Alias (User Manual Name) for SENT_CH10_SCR.
* To use register names with standard convension, please use SENT_CH10_SCR.
*/
#define	SENT_SCR10	(SENT_CH10_SCR)

/** \\brief  390, Serial Data and Status Register */
#define SENT_CH10_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003390u)

/** Alias (User Manual Name) for SENT_CH10_SDS.
* To use register names with standard convension, please use SENT_CH10_SDS.
*/
#define	SENT_SDS10	(SENT_CH10_SDS)

/** \\brief  39C, Receive Data View Register */
#define SENT_CH10_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF000339Cu)

/** Alias (User Manual Name) for SENT_CH10_VIEW.
* To use register names with standard convension, please use SENT_CH10_VIEW.
*/
#define	SENT_VIEW10	(SENT_CH10_VIEW)

/** \\brief  3B4, Watch Dog Timer Register */
#define SENT_CH10_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00033B4u)

/** Alias (User Manual Name) for SENT_CH10_WDT.
* To use register names with standard convension, please use SENT_CH10_WDT.
*/
#define	SENT_WDT10	(SENT_CH10_WDT)

/** \\brief  3C4, Channel Fractional Divider Register */
#define SENT_CH11_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF00033C4u)

/** Alias (User Manual Name) for SENT_CH11_CFDR.
* To use register names with standard convension, please use SENT_CH11_CFDR.
*/
#define	SENT_CFDR11	(SENT_CH11_CFDR)

/** \\brief  3C0, Channel Pre Divider Register */
#define SENT_CH11_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF00033C0u)

/** Alias (User Manual Name) for SENT_CH11_CPDR.
* To use register names with standard convension, please use SENT_CH11_CPDR.
*/
#define	SENT_CPDR11	(SENT_CH11_CPDR)

/** \\brief  3F0, Interrupt Node Pointer Register */
#define SENT_CH11_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF00033F0u)

/** Alias (User Manual Name) for SENT_CH11_INP.
* To use register names with standard convension, please use SENT_CH11_INP.
*/
#define	SENT_INP11	(SENT_CH11_INP)

/** \\brief  3E8, Interrupt Clear Register */
#define SENT_CH11_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF00033E8u)

/** Alias (User Manual Name) for SENT_CH11_INTCLR.
* To use register names with standard convension, please use SENT_CH11_INTCLR.
*/
#define	SENT_INTCLR11	(SENT_CH11_INTCLR)

/** \\brief  3EC, Interrupt Enable Register */
#define SENT_CH11_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF00033ECu)

/** Alias (User Manual Name) for SENT_CH11_INTEN.
* To use register names with standard convension, please use SENT_CH11_INTEN.
*/
#define	SENT_INTEN11	(SENT_CH11_INTEN)

/** \\brief  3E4, Interrupt Set Register */
#define SENT_CH11_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF00033E4u)

