HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSent_reg.h
/** Alias (User Manual Name) for SENT_CH11_INTSET.
* To use register names with standard convension, please use SENT_CH11_INTSET.
*/
#define	SENT_INTSET11	(SENT_CH11_INTSET)

/** \\brief  3E0, Interrupt Status Register */
#define SENT_CH11_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF00033E0u)

/** Alias (User Manual Name) for SENT_CH11_INTSTAT.
* To use register names with standard convension, please use SENT_CH11_INTSTAT.
*/
#define	SENT_INTSTAT11	(SENT_CH11_INTSTAT)

/** \\brief  3D4, Input and Output Control Register */
#define SENT_CH11_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF00033D4u)

/** Alias (User Manual Name) for SENT_CH11_IOCR.
* To use register names with standard convension, please use SENT_CH11_IOCR.
*/
#define	SENT_IOCR11	(SENT_CH11_IOCR)

/** \\brief  3C8, Receiver Control Register */
#define SENT_CH11_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF00033C8u)

/** Alias (User Manual Name) for SENT_CH11_RCR.
* To use register names with standard convension, please use SENT_CH11_RCR.
*/
#define	SENT_RCR11	(SENT_CH11_RCR)

/** \\brief  3CC, Receive Status Register */
#define SENT_CH11_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF00033CCu)

/** Alias (User Manual Name) for SENT_CH11_RSR.
* To use register names with standard convension, please use SENT_CH11_RSR.
*/
#define	SENT_RSR11	(SENT_CH11_RSR)

/** \\brief  3D8, SPC Control Register */
#define SENT_CH11_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF00033D8u)

/** Alias (User Manual Name) for SENT_CH11_SCR.
* To use register names with standard convension, please use SENT_CH11_SCR.
*/
#define	SENT_SCR11	(SENT_CH11_SCR)

/** \\brief  3D0, Serial Data and Status Register */
#define SENT_CH11_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF00033D0u)

/** Alias (User Manual Name) for SENT_CH11_SDS.
* To use register names with standard convension, please use SENT_CH11_SDS.
*/
#define	SENT_SDS11	(SENT_CH11_SDS)

/** \\brief  3DC, Receive Data View Register */
#define SENT_CH11_VIEW /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_VIEW*)0xF00033DCu)

/** Alias (User Manual Name) for SENT_CH11_VIEW.
* To use register names with standard convension, please use SENT_CH11_VIEW.
*/
#define	SENT_VIEW11	(SENT_CH11_VIEW)

/** \\brief  3F4, Watch Dog Timer Register */
#define SENT_CH11_WDT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_WDT*)0xF00033F4u)

/** Alias (User Manual Name) for SENT_CH11_WDT.
* To use register names with standard convension, please use SENT_CH11_WDT.
*/
#define	SENT_WDT11	(SENT_CH11_WDT)

/** \\brief  404, Channel Fractional Divider Register */
#define SENT_CH12_CFDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CFDR*)0xF0003404u)

/** Alias (User Manual Name) for SENT_CH12_CFDR.
* To use register names with standard convension, please use SENT_CH12_CFDR.
*/
#define	SENT_CFDR12	(SENT_CH12_CFDR)

/** \\brief  400, Channel Pre Divider Register */
#define SENT_CH12_CPDR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_CPDR*)0xF0003400u)

/** Alias (User Manual Name) for SENT_CH12_CPDR.
* To use register names with standard convension, please use SENT_CH12_CPDR.
*/
#define	SENT_CPDR12	(SENT_CH12_CPDR)

/** \\brief  430, Interrupt Node Pointer Register */
#define SENT_CH12_INP /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INP*)0xF0003430u)

/** Alias (User Manual Name) for SENT_CH12_INP.
* To use register names with standard convension, please use SENT_CH12_INP.
*/
#define	SENT_INP12	(SENT_CH12_INP)

/** \\brief  428, Interrupt Clear Register */
#define SENT_CH12_INTCLR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTCLR*)0xF0003428u)

/** Alias (User Manual Name) for SENT_CH12_INTCLR.
* To use register names with standard convension, please use SENT_CH12_INTCLR.
*/
#define	SENT_INTCLR12	(SENT_CH12_INTCLR)

/** \\brief  42C, Interrupt Enable Register */
#define SENT_CH12_INTEN /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTEN*)0xF000342Cu)

/** Alias (User Manual Name) for SENT_CH12_INTEN.
* To use register names with standard convension, please use SENT_CH12_INTEN.
*/
#define	SENT_INTEN12	(SENT_CH12_INTEN)

/** \\brief  424, Interrupt Set Register */
#define SENT_CH12_INTSET /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSET*)0xF0003424u)

/** Alias (User Manual Name) for SENT_CH12_INTSET.
* To use register names with standard convension, please use SENT_CH12_INTSET.
*/
#define	SENT_INTSET12	(SENT_CH12_INTSET)

/** \\brief  420, Interrupt Status Register */
#define SENT_CH12_INTSTAT /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_INTSTAT*)0xF0003420u)

/** Alias (User Manual Name) for SENT_CH12_INTSTAT.
* To use register names with standard convension, please use SENT_CH12_INTSTAT.
*/
#define	SENT_INTSTAT12	(SENT_CH12_INTSTAT)

/** \\brief  414, Input and Output Control Register */
#define SENT_CH12_IOCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_IOCR*)0xF0003414u)

/** Alias (User Manual Name) for SENT_CH12_IOCR.
* To use register names with standard convension, please use SENT_CH12_IOCR.
*/
#define	SENT_IOCR12	(SENT_CH12_IOCR)

/** \\brief  408, Receiver Control Register */
#define SENT_CH12_RCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RCR*)0xF0003408u)

/** Alias (User Manual Name) for SENT_CH12_RCR.
* To use register names with standard convension, please use SENT_CH12_RCR.
*/
#define	SENT_RCR12	(SENT_CH12_RCR)

/** \\brief  40C, Receive Status Register */
#define SENT_CH12_RSR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_RSR*)0xF000340Cu)

/** Alias (User Manual Name) for SENT_CH12_RSR.
* To use register names with standard convension, please use SENT_CH12_RSR.
*/
#define	SENT_RSR12	(SENT_CH12_RSR)

/** \\brief  418, SPC Control Register */
#define SENT_CH12_SCR /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SCR*)0xF0003418u)

/** Alias (User Manual Name) for SENT_CH12_SCR.
* To use register names with standard convension, please use SENT_CH12_SCR.
*/
#define	SENT_SCR12	(SENT_CH12_SCR)

/** \\brief  410, Serial Data and Status Register */
#define SENT_CH12_SDS /*lint --e(923)*/ (*(volatile Ifx_SENT_CH_SDS*)0xF0003410u)

/** Alias (User Manual Name) for SENT_CH12_SDS.
* To use register names with standard convension, please use SENT_CH12_SDS.
*/
#define	SENT_SDS12	(SENT_CH12_SDS)

